Revit 2027 API
DirectShapeLibrary.FindDefinitionType Method
 Find a DirectShapeType element by definition id. The element will be used for creating instances of that definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FindDefinitionType(
	string id
)
Public Function FindDefinitionType (
	id As String
) As ElementId
public:
ElementId^ FindDefinitionType(
	String^ id
)
member FindDefinitionType :
        id : string -> ElementId
Parameters
id String
 Definition id. Expected to be unique.
Return Value
ElementId
 Element id of a DirectShapeTypeElement
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace